Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [25]:
### Answer 1

In [26]:
import pandas as pd

In [27]:
df = pd.read_excel("pandas excel.xlsx")

In [28]:
df

   SR  Number
0   1       4
1   2       8
2   3      15
3   4      16
4   5      23
5   6      42

In [29]:
df_1 = df['Number']

In [30]:
df_1

0     4
1     8
2    15
3    16
4    23
5    42
Name: Number, dtype: int64

In [31]:
type(df_1)

pandas.core.series.Series

In [22]:
pd.Series([4, 8, 15, 16, 23, 42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [23]:
### Answer 2

In [24]:
l1 = [1,42,3,34,5,26,7,18,9,10]

In [32]:
pd.Series(l1)

0     1
1    42
2     3
3    34
4     5
5    26
6     7
7    18
8     9
9    10
dtype: int64

In [33]:
type(pd.Series(l1))

pandas.core.series.Series

In [49]:
### Answer 3

In [40]:
Data_Frame = {'Name': ['Alice', 'Bob', 'Claire'], 'Age' : [25, 30, 27], 'Gender' : ['Female', 'Age', 'Gender']}

In [44]:
df3 = pd.DataFrame(Data_Frame)

In [45]:
print(df3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30     Age
2  Claire   27  Gender

In [46]:
type(df3)

pandas.core.frame.DataFrame

In [43]:
df_3 = pd.Series(Data_Frame)

Name       [Alice, Bob, Claire]
Age                [25, 30, 27]
Gender    [Female, Age, Gender]
dtype: object

In [37]:
df_2 = pd.read_excel('data_frame.xlsx')

In [38]:
df_2

    Name   Age  Gender
0   Alice   25  Female
1     Bob   30    male
2  Claire   27  Female

In [39]:
type(df_2)

pandas.core.frame.DataFrame

### Answer 4

a DataFrame is a two-dimensional labeled data structure that can store data of different types, such as numerical, categorical, and text data. It can be thought of as a table, where each row represents a sample or observation, and each column represents a feature or variable. A DataFrame can be created from various data sources, such as a NumPy array, a Python dictionary, or an external file (e.g., CSV, Excel).

On the other hand, a Series is a one-dimensional labeled data structure in Pandas that can store data of a single data type, such as integers, floats, or strings. It can be thought of as a single column of a DataFrame, where each value is associated with an index label.

In [61]:
Data= {'Name': ['Alice', 'Bob', 'Claire', 'Sam'], 'Age' : [25, 30, 27, 24], 'Gender' : ['Female', 'male', 'female', 'male']}

In [62]:
df4 = pd.DataFrame(Data)

In [65]:
df4

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    male
2  Claire   27  female
3     Sam   24    male

In [63]:
ages = df4["Age"]

In [64]:
print(ages)

0    25
1    30
2    27
3    24
Name: Age, dtype: int64

In [66]:
Names = df4['Name']

In [67]:
print(Names)

0     Alice
1       Bob
2    Claire
3       Sam
Name: Name, dtype: object

In [68]:
### Answer 5

head(n): Returns the first n rows of the DataFrame,
tail(n): Returns the last n rows of the DataFrame,
info(): Displays information about the DataFrame, such as the number of rows and columns, data types, and memory usage, 
describe(): Generates descriptive statistics of the DataFrame, such as count, mean, standard deviation, minimum, and maximum values, 
shape: Returns the dimensions of the DataFrame in the form of a tuple (rows, columns),
drop(columns=[...]): Drops one or more columns from the DataFrame

In [70]:
df5 = df4.head(2)

In [71]:
print(df5)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    male

### Answer 6

 both Series and DataFrame are mutable in nature, which means that their contents can be modified after creation. 
 
 Pandas provides multi-dimensional data structures like Panel with the combination of DataFrame and Series objects.

In [83]:
## Answer 7

In [84]:
Name = pd.Series(['sam', 'sid', 'babs', 'gudda', 'tisa', 'tiu'])
Age = pd.Series(['24', '20', '23', '27', '18', '5'])
Gender = pd.Series(['male', 'female', 'female', 'female', 'female', 'female'])

In [87]:
df7 = pd.concat([Name, Age, Gender], axis = 1)
df7.columns = ['Name', 'Age', 'Gender']

In [88]:
df7

    Name Age  Gender
0    sam  24    male
1    sid  20  female
2   babs  23  female
3  gudda  27  female
4   tisa  18  female
5    tiu   5  female